tutorials/incompressibleFluid/rotor2DSRF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    rotor
    {
        type            MRFnoSlip;
    }

    freestream
    {
        type                MRFFreestreamVelocity;
        freestreamValue0    (1 0 0);
        freestreamValue     $internalField;
    }
}

// ************************************************************************* //
